#include <stdio.h>
#include <locale.h>

int main() {
	setlocale(LC_ALL, "RUS");
	double x, y;

	printf("Введите x и y: ");
	scanf("%lf %lf", &x, &y);

	if ((x * x + y * y <= 2.0) && (x >= 0.0) && (y <= -x) && ((x * x + y * y == 2.0) || (x == 0.0) || (y == -x))) {
		printf("Точка (%.2f, %.2f) находится на границе области\n", x, y);
	}

	else if ((x * x + y * y < 2.0) && (x > 0.0) && (y < -x)) {
		printf("Точка (%.2f, %.2f) принадлежит области\n", x, y);
	}
	else  {
		printf("Точка (%.2f, %.2f) не принадлежит области\n", x, y);
	}
	return 0;
}

//КОНТРОЛЬНЫЙ ПРИМЕР:
//1. (x, y) = (0,5, -1) → принадлежит области
//2. (x, y) = (2, 2) → не принадлежит области
//3. (x, y) = (1, -1) → находится на границе области